#include <Dolphin/CARD.h>
#include <Dolphin/OS.h>
#include <Dolphin/math.h>
#include <Dolphin/string.h>
#include <Dolphin/types.h>

#include <JSystem/J2D/J2DOrthoGraph.hxx>
#include <JSystem/J2D/J2DTextBox.hxx>

#include <SMS/System/Application.hxx>

#include <BetterSMS/game.hxx>
#include <BetterSMS/loading.hxx>
#include <BetterSMS/module.hxx>
#include <BetterSMS/settings.hxx>
#include <BetterSMS/stage.hxx>
#include <raw_fn.hxx>
#include <rand.h>
#include <BetterSMS/debug.hxx>
#include <JDrama/JDRActor.hxx>
#include <MarioUtil/MathUtil.hxx>
#include <GX.h>
#include <settings.hxx>
#include <Map/MapCollisionData.hxx>
//#include <JGeometry/JGMMatrix.hxx>
//#include <JGeometry/JGMUtil.hxx>

const u32 SunsetGrass[3]     = {0x7E8736ff, 0x216118ff, 0x0};
const u32 SunsetGrassDark[3] = {0x5C581Dff, 0x172502ff, 0x006100ff};
const u32 TwilightGrass[3]   = {0x316C3Eff, 0x105216ff, 0x0};

#if 1
SMS_WRITE_32(SMS_PORT_REGION(0x801494C0, 0, 0, 0), 0x3fc0ad77);
SMS_WRITE_32(SMS_PORT_REGION(0x801494C4, 0, 0, 0), 0x63C0AD88);
SMS_WRITE_32(SMS_PORT_REGION(0x801494E0, 0, 0, 0), 0x63c00000);
#endif

#if 1
struct triangle {
public:
    float x;
    float y;
    float z;
};
struct trishort {
public:
    short x;
    short y;
    short z;
};
class grassObj {
public:
    u8 data[0x14]; //use 0x13 for something
    float grassFloor;   // 0x14
    u32 data2[0x14];     // 0x18 We can use 0x6 - 0x9
    u32 triCount;       // 0x68
    triangle *tris;     // 0x6c
    bool *shTris;   // 0x70
    u32 unk2;           // 0x74
    u32 unk3;           // 0x78
};
class grassManager {
public:
    u8 unk[0x20];
    float *data;        // 0x20
    float *shData;      // 0x24
};

#define _mDrawVec            *(float *)0x803fa2a8
#define DAT_803fa2b0         *(float *)0x803fa2b0
#define gpMapObjGrassManager (*((grassManager **)0x8040df7c))
SMS_WRITE_32(0x801e9234, 0x60000000);  // make all grass drawNear for now

static const TBGCheckData *floorBuffer = new TBGCheckData;

#define JSysNew ((int (*)(...))0x802c3ca4)
#define shadeList ((bool *)grassGroup->data2[0x7])
void initGrassShade(grassObj *grassGroup) {
    //OSReport("%p %p %p %p\n", grassGroup->data2[0x0], grassGroup->data2[0x1],
    //         grassGroup->data2[0x2], grassGroup->data2[0x3]);
    //OSReport("4 %p %p %p %p\n", grassGroup->data2[0x4], grassGroup->data2[0x5],
    //         grassGroup->data2[0x6], grassGroup->data2[0x7]);
    //OSReport("8 %p %p %p %p\n", grassGroup->data2[0x8], grassGroup->data2[0x9],
    //         grassGroup->data2[0xa], grassGroup->data2[0xb]);
    triangle triVar;
    if (grassGroup->data2[0x8]) return;
